Table of Contents
 Class CrossSectionCreepCoefficientData
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Cross-section component creep coefficient data
[OpenModelClass("CI.StructModel.Libraries.CrossSection.ComponentCreepCoefficientDataItem,CI.CrossSection")]
public class CrossSectionCreepCoefficientData
Inheritance
object
CrossSectionCreepCoefficientData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 ComponentIndex
Zero based index of component
public List<int> ComponentIndex { get; set; }
Property Value
List<int>
 CreepInput
User-defined curvature for creep coefficient { x = t[day], y = ϕ }
public InputValueType CreepInput { get; set; }
Property Value
InputValueType
 Humidity
Humidity in the relative value
public double Humidity { get; set; }
Property Value
double
 NotionalSize
User-defined notional size
public double NotionalSize { get; set; }
Property Value
double
 NotionalSizeInput
Input type of Notional size
public InputValueType NotionalSizeInput { get; set; }
Property Value
InputValueType
 UserCreepCoeeficient
User creep coefficient
public Polygon2D UserCreepCoeeficient { get; set; }
Property Value
Polygon2D
 Edit this page